comp.org
#+title: Compiler Construction Course
#+author: Mayer Goldberg
#+email: gmayer@little-lisper.org
#+options: creator:nil, toc:nil


* Compiler Construction

- [[ws-file:2013-2014-compiler-construction-syllabus.pdf][Syllabus]]
- [[http://www.cs.bgu.ac.il/~comp141/Main][Announcements, forum, and contacting us]]
- [[./special.html][My policies on extensions, exemptions & special requests]]

* Coursework

- [[ws-file:2013-2014-compiler-construction-hw1.html][Assignment 1]] Due: Thursday, November 7, 2013.
  - [[ws-file:pc.py][Parsing Combinators in Python]]
  - The file [[ws-file:chem.py][=chem.py=]], containing the periodic table as a giant hash table
- [[ws-file:2013-2014-hw2.html][Assignment 2]] Due: Sunday, December 8, 2013.
  - The file [[ws-file:naive-qq.scm][=naive-qq.scm=]], which implements a naïve, one-level expansion for quasiquotation. You will need to implement this code in Python for your quasiquotation expansion. 
- [[ws-file:2013-2014-hw3.html][Assignment 3]] Due: Thursday, December 26, 2013.
- [[ws-file:from-direct-style-via-cps-to-the-stack-machine.html][From direct style, via CPS, to the stack machine]]
- Multithreading functions: [[ws-file:fib+ack.pdf][PDF]], [[ws-file:fib+ack.sml][SML code]] 
- [[ws-file:2013-2014-comp-project.html][The Final Project]] Due: Tuesday, February 4, 2014.
  - [[ws-file:arch.zip][The CISC-like /arch/ architecture]]

