comp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Compiler Construction Course</title>
<!-- 2014-01-20 Mon 10:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="Mayer Goldberg"/>
<link rel="shortcut icon" type="image/x-icon" href="http://www.little-lisper.org/website/favicon.ico" />
<link rel="apple-touch-icon" type="image/x-icon" href="http://www.little-lisper.org/website/favicon.png" />
</head>
<body>
<div id="content">
<h1 class="title">Compiler Construction Course</h1>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Compiler Construction</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://www.little-lisper.org/website/files/2013-2014-compiler-construction-syllabus.pdf">Syllabus</a>
</li>
<li><a href="http://www.cs.bgu.ac.il/~comp141/Main">Announcements, forum, and contacting us</a>
</li>
<li><a href="./special.html">My policies on extensions, exemptions &amp; special requests</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Coursework</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://www.little-lisper.org/website/files/2013-2014-compiler-construction-hw1.html">Assignment 1</a> Due: Thursday, November 7, 2013.
<ul class="org-ul">
<li><a href="http://www.little-lisper.org/website/files/pc.py">Parsing Combinators in Python</a>
</li>
<li>The file <a href="http://www.little-lisper.org/website/files/chem.py"><code>chem.py</code></a>, containing the periodic table as a giant hash table
</li>
</ul>
</li>
<li><a href="http://www.little-lisper.org/website/files/2013-2014-hw2.html">Assignment 2</a> Due: Sunday, December 8, 2013.
<ul class="org-ul">
<li>The file <a href="http://www.little-lisper.org/website/files/naive-qq.scm"><code>naive-qq.scm</code></a>, which implements a naïve, one-level expansion for quasiquotation. You will need to implement this code in Python for your quasiquotation expansion. 
</li>
</ul>
</li>
<li><a href="http://www.little-lisper.org/website/files/2013-2014-hw3.html">Assignment 3</a> Due: Thursday, December 26, 2013.
</li>
<li><a href="http://www.little-lisper.org/website/files/from-direct-style-via-cps-to-the-stack-machine.html">From direct style, via CPS, to the stack machine</a>
</li>
<li>Multithreading functions: <a href="http://www.little-lisper.org/website/files/fib+ack.pdf">PDF</a>, <a href="http://www.little-lisper.org/website/files/fib+ack.sml">SML code</a> 
</li>
<li><a href="http://www.little-lisper.org/website/files/2013-2014-comp-project.html">The Final Project</a> Due: Tuesday, February 4, 2014.
<ul class="org-ul">
<li><a href="http://www.little-lisper.org/website/files/arch.zip">The CISC-like <i>arch</i> architecture</a>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mayer Goldberg</p>
<p class="date">Created: 2014-01-20 Mon 10:32</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>